lkolbly/cmsis-svd/data/Cypress/S6E2DH.svd
        <!-- REGISTER "IRQ115MON" -->
        <register>
          <name>IRQ115MON</name>
          <description>IRQ115 Batch Read Register</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QSPIINT2" -->
            <field>
              <name>QSPIINT2</name>
              <description>Interrupt request of fault detection interrupt of Hi-Speed Quad SPI</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QSPIINT1" -->
            <field>
              <name>QSPIINT1</name>
              <description>Interrupt request of transmission interrupt of Hi-Speed Quad SPI</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QSPIINT0" -->
            <field>
              <name>QSPIINT0</name>
              <description>Interrupt request of reception interrupt of Hi-Speed Quad SPI</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ116MON" -->
        <register>
          <name>IRQ116MON</name>
          <description>IRQ116 Batch Read Register</description>
          <addressOffset>0x3D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
        <!-- REGISTER "IRQ117MON" -->
        <register>
          <name>IRQ117MON</name>
          <description>IRQ117 Batch Read Register</description>
          <addressOffset>0x3D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "I2S1INT" -->
            <field>
              <name>I2S1INT</name>
              <description>Interrupt request of I2S ch.1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PRGCRC" -->
            <field>
              <name>PRGCRC</name>
              <description>Interrupt request of Programmable CRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "I2SINT" -->
            <field>
              <name>I2SINT</name>
              <description>Interrupt request of I2S</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ118MON" -->
        <register>
          <name>IRQ118MON</name>
          <description>IRQ118 Batch Read Register</description>
          <addressOffset>0x3DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDINT1" -->
            <field>
              <name>SDINT1</name>
              <description>SD card interrupt request</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDINT0" -->
            <field>
              <name>SDINT0</name>
              <description>Interrupt request of aggregation of all SD I/F interrupt sources</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ119MON" -->
        <register>
          <name>IRQ119MON</name>
          <description>IRQ119 Batch Read Register</description>
          <addressOffset>0x3E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLINT" -->
            <field>
              <name>FLINT</name>
              <description>Interrupt request of the Flash I/F</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ120MON" -->
        <register>
          <name>IRQ120MON</name>
          <description>IRQ120 Batch Read Register</description>
          <addressOffset>0x3E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC HS-SPICNT reception</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description>Reception interrupt request of the MFS ch.12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ121MON" -->
        <register>
          <name>IRQ121MON</name>
          <description>IRQ121 Batch Read Register</description>
          <addressOffset>0x3E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x103</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC HS-SPICNT transmission</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request of the MFS ch.12</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request of the MFS ch.12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ122MON" -->
        <register>
          <name>IRQ122MON</name>
          <description>IRQ122 Batch Read Register</description>
          <addressOffset>0x3EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC HS-SPICNT fault detection</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description>Reception interrupt request of the MFS ch.13</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ123MON" -->
        <register>
          <name>IRQ123MON</name>
          <description>IRQ123 Batch Read Register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x103</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCINT" -->
            <field>
              <name>GDCINT</name>
              <description>Interrupt request of the GDC HyperBus Interface</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description>Status interrupt request of the MFS ch.13</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description>Transmission interrupt request of the MFS ch.13</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
