lkolbly/cmsis-svd/data/Cypress/S6E2DH.svd
        <!-- REGISTER "GPCR3" -->
        <register>
          <name>GPCR3</name>
          <description>GSS PLL Control Register 3</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPLLK" -->
            <field>
              <name>GPLLK</name>
              <description>PLL input clock frequency division ratio setting bits</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GPCR4" -->
        <register>
          <name>GPCR4</name>
          <description>GSS PLL Control Register 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPLLN" -->
            <field>
              <name>GPLLN</name>
              <description>PLL feedback frequency division rasio seting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GP_STR" -->
        <register>
          <name>GP_STR</name>
          <description>GSS PLL Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPRDY" -->
            <field>
              <name>GPRDY</name>
              <description>GDC PLL status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GPINT_ENR" -->
        <register>
          <name>GPINT_ENR</name>
          <description>GSS PLL Interrupt Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPCSE" -->
            <field>
              <name>GPCSE</name>
              <description>PLL oscillation stabilization wait completion interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GPINT_CLR" -->
        <register>
          <name>GPINT_CLR</name>
          <description>GSS PLL Interrupt Clear Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPCSC" -->
            <field>
              <name>GPCSC</name>
              <description>GDC PLL oscillation stabilization wait completion interrupt clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GPINT_STR" -->
        <register>
          <name>GPINT_STR</name>
          <description>GSS PLL Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPCSI" -->
            <field>
              <name>GPCSI</name>
              <description>GDC PLL oscillation stabilization wait completion interrupt status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GCSR" -->
        <register>
          <name>GCSR</name>
          <description>GSS Clock Select Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001113</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PCG" -->
            <field>
              <name>PCG</name>
              <description>HCLK Clock gating for Reference clock for Peripherals setting bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description>Peripheral clock for the GDC Sub system selection bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACG" -->
            <field>
              <name>ACG</name>
              <description>Clock gating for Reference clock for GDC clock setting bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ASEL" -->
            <field>
              <name>ASEL</name>
              <description>Reference clock for the GDC clock selection bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GRCR" -->
        <register>
          <name>GRCR</name>
          <description>GSS Reset Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSTEN" -->
            <field>
              <name>RSTEN</name>
              <description>Software reset for the GDC Sub system setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GMCR" -->
        <register>
          <name>GMCR</name>
          <description>GSS Mode Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TEN" -->
            <field>
              <name>TEN</name>
              <description>PLL oscillation under case of TIMER mode control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
