lkolbly/cmsis-svd/data/Cypress/S6E2DH.svd
        <!-- REGISTER "PZR0" -->
        <register derivedFrom="DDR0">
          <name>PZR0</name>
          <description>Port Pseudo Open Drain Setting Register 0</description>
          <addressOffset>0x700</addressOffset>
        </register>
        <!-- REGISTER "PZR1" -->
        <register derivedFrom="DDR1">
          <name>PZR1</name>
          <description>Port Pseudo Open Drain Setting Register 1</description>
          <addressOffset>0x704</addressOffset>
        </register>
        <!-- REGISTER "PZR2" -->
        <register derivedFrom="DDR2">
          <name>PZR2</name>
          <description>Port Pseudo Open Drain Setting Register 2</description>
          <addressOffset>0x708</addressOffset>
        </register>
        <!-- REGISTER "PZR3" -->
        <register derivedFrom="DDR3">
          <name>PZR3</name>
          <description>Port Pseudo Open Drain Setting Register 3</description>
          <addressOffset>0x70C</addressOffset>
        </register>
        <!-- REGISTER "PZR4" -->
        <register derivedFrom="DDR4">
          <name>PZR4</name>
          <description>Port Pseudo Open Drain Setting Register 4</description>
          <addressOffset>0x710</addressOffset>
        </register>
        <!-- REGISTER "PZR5" -->
        <register derivedFrom="DDR5">
          <name>PZR5</name>
          <description>Port Pseudo Open Drain Setting Register 5</description>
          <addressOffset>0x714</addressOffset>
        </register>
        <!-- REGISTER "PZR6" -->
        <register derivedFrom="DDR6">
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
        </register>
        <!-- REGISTER "PZR7" -->
        <register derivedFrom="DDR7">
          <name>PZR7</name>
          <description>Port Pseudo Open Drain Setting Register 7</description>
          <addressOffset>0x71C</addressOffset>
        </register>
        <!-- REGISTER "PZR8" -->
        <register derivedFrom="DDR8">
          <name>PZR8</name>
          <description>Port Pseudo Open Drain Setting Register 8</description>
          <addressOffset>0x720</addressOffset>
        </register>
        <!-- REGISTER "PZR9" -->
        <register derivedFrom="DDR9">
          <name>PZR9</name>
          <description>Port Pseudo Open Drain Setting Register 9</description>
          <addressOffset>0x724</addressOffset>
        </register>
        <!-- REGISTER "PZRA" -->
        <register derivedFrom="DDRA">
          <name>PZRA</name>
          <description>Port Pseudo Open Drain Setting Register A</description>
          <addressOffset>0x728</addressOffset>
        </register>
        <!-- REGISTER "PZRB" -->
        <register derivedFrom="DDRB">
          <name>PZRB</name>
          <description>Port Pseudo Open Drain Setting Register B</description>
          <addressOffset>0x72C</addressOffset>
        </register>
        <!-- REGISTER "PZRC" -->
        <register derivedFrom="DDRC">
          <name>PZRC</name>
          <description>Port Pseudo Open Drain Setting Register C</description>
          <addressOffset>0x730</addressOffset>
        </register>
        <!-- REGISTER "PZRD" -->
        <register derivedFrom="DDRD">
          <name>PZRD</name>
          <description>Port Pseudo Open Drain Setting Register D</description>
          <addressOffset>0x734</addressOffset>
        </register>
        <!-- REGISTER "PZRE" -->
        <register derivedFrom="DDRE">
          <name>PZRE</name>
          <description>Port Pseudo Open Drain Setting Register E</description>
          <addressOffset>0x738</addressOffset>
        </register>
        <!-- REGISTER "PZRF" -->
        <register derivedFrom="DDRF">
          <name>PZRF</name>
          <description>Port Pseudo Open Drain Setting Register F</description>
          <addressOffset>0x73C</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CANFD" -->
    <peripheral>
      <name>CANFD</name>
      <description>CAN FD Registers</description>
      <version>A</version>
      <groupName>CANFD</groupName>
      <baseAddress>0x40070000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x35</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3A</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xDC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "CANFD" -->
      <interrupt>
        <name>CANFD</name>
        <value>81</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CREL" -->
        <register>
          <name>CREL</name>
          <description>Core Release Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x30130506</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REL" -->
            <field>
              <name>REL</name>
              <description>Core Release</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STEP" -->
            <field>
              <name>STEP</name>
              <description>Step of Core Release</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SUBSTEP" -->
            <field>
              <name>SUBSTEP</name>
              <description>Sub-step of Core Release</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "YEAR" -->
            <field>
              <name>YEAR</name>
              <description>Time Stamp Year</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MON" -->
            <field>
              <name>MON</name>
              <description>Time Stamp Month</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DAY" -->
            <field>
              <name>DAY</name>
              <description>Time Stamp Day</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ENDN" -->
        <register>
          <name>ENDN</name>
          <description>Endian Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x87654321</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ETV" -->
            <field>
              <name>ETV</name>
              <description>Endianness Test Value</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FBTP" -->
        <register>
          <name>FBTP</name>
          <description>Fast Bit Timing and Prescaler Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F9F0F73</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDCO" -->
            <field>
              <name>TDCO</name>
              <description>Transceiver Delay Compensation Offset</description>
              <msb>28</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDC" -->
            <field>
              <name>TDC</name>
              <description>Transceiver Delay Compensation</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FBRP" -->
            <field>
              <name>FBRP</name>
              <description>Fast Baud Rate Prescaler</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTSEG1" -->
            <field>
              <name>FTSEG1</name>
              <description>Fast time segment before sample point</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTSEG2" -->
            <field>
              <name>FTSEG2</name>
              <description>Fast time segment after sample point</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSJW" -->
            <field>
              <name>FSJW</name>
              <description>Fast (Re) Synchronization Jump Width</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TEST" -->
        <register>
          <name>TEST</name>
          <description>Test Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDCV" -->
            <field>
              <name>TDCV</name>
              <description>Transceiver Delay Compensation Value</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RX" -->
            <field>
              <name>RX</name>
              <description>Receive Pin</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TX" -->
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBCK" -->
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RWD" -->
        <register>
          <name>RWD</name>
          <description>RAM Watchdog</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WDV" -->
            <field>
              <name>WDV</name>
              <description>Watchdog Value</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WDC" -->
            <field>
              <name>WDC</name>
              <description>Watchdog Configuration</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CCCR" -->
        <register>
          <name>CCCR</name>
          <description>CC Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXP" -->
            <field>
              <name>TXP</name>
              <description>Transmit Pause</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDBS" -->
            <field>
              <name>FDBS</name>
              <description>CAN FD Bit Rate Switching</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FDO" -->
            <field>
              <name>FDO</name>
              <description>CAN FD Operation</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMR" -->
            <field>
              <name>CMR</name>
              <description>CAN Mode Request</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CME" -->
            <field>
              <name>CME</name>
              <description>CAN Mode Enable</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test Mode Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DAR" -->
            <field>
              <name>DAR</name>
              <description>Disable Automatic Retransmission</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MON" -->
            <field>
              <name>MON</name>
              <description>Bus Monitoring Mode</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSR" -->
            <field>
              <name>CSR</name>
              <description>Clock Stop Request</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSA" -->
            <field>
              <name>CSA</name>
              <description>Clock Stop Acknowledge</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ASM" -->
            <field>
              <name>ASM</name>
              <description>Restricted Operation Mode</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CCE" -->
            <field>
              <name>CCE</name>
              <description>Configuration Change Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INIT" -->
            <field>
              <name>INIT</name>
              <description>Initialization</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BTP" -->
        <register>
          <name>BTP</name>
          <description>Bit Timing and Prescaler Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000A33</resetValue>
          <resetMask>0x03FF3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BRP" -->
            <field>
              <name>BRP</name>
              <description>Baud Rate Prescaler</description>
              <msb>25</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEG1" -->
            <field>
              <name>TSEG1</name>
              <description>Time segment before sample point</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEG2" -->
            <field>
              <name>TSEG2</name>
              <description>Time segment after sample point</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SJW" -->
            <field>
              <name>SJW</name>
              <description>(Re) Synchronization Jump Width</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCC" -->
        <register>
          <name>TSCC</name>
          <description>Timestamp Counter Configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCP" -->
            <field>
              <name>TCP</name>
              <description>Timestamp Counter Prescaler</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description>Timestamp Select</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCV" -->
        <register>
          <name>TSCV</name>
          <description>Timestamp Counter Value</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSC" -->
            <field>
              <name>TSC</name>
              <description>Timestamp Counter</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
