lkolbly/cmsis-svd/data/Cypress/S6E2DH.svd
        <!-- REGISTER "FDSEAR" -->
        <register>
          <name>FDSEAR</name>
          <description>CAN FD ECC Single-bit Error Address Register</description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRA" -->
            <field>
              <name>SRA</name>
              <description>Single-bit error Message RAM address bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDESCR" -->
        <register>
          <name>FDESCR</name>
          <description>CAN FD ECC Error Status Clear Register</description>
          <addressOffset>0x205</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DEIC" -->
            <field>
              <name>DEIC</name>
              <description>Double-bit error clear bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SEIC" -->
            <field>
              <name>SEIC</name>
              <description>Sngle-bit error clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDDEAR" -->
        <register>
          <name>FDDEAR</name>
          <description>CAN FD ECC Double-bit Error Address Register</description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRA" -->
            <field>
              <name>DRA</name>
              <description>Double-bit error Message RAM address bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCNTR" -->
        <register>
          <name>TSCNTR</name>
          <description>Time Stamp Control Register</description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CCLR" -->
            <field>
              <name>CCLR</name>
              <description>Counter clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSMDR" -->
        <register>
          <name>TSMDR</name>
          <description>Time Stamp Mode Register</description>
          <addressOffset>0x212</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNTEN" -->
            <field>
              <name>CNTEN</name>
              <description>Counter enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSDIVR" -->
        <register>
          <name>TSDIVR</name>
          <description>Time Stamp Divider Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description>Counter clock division ratio setting bit</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCDTR" -->
        <register>
          <name>TSCDTR</name>
          <description>Time Stamp Counter Data Register</description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNT" -->
            <field>
              <name>CNT</name>
              <description>Counter value bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCPCLR" -->
        <register>
          <name>TSCPCLR</name>
          <description>Time Stamp Compare Clear Register</description>
          <addressOffset>0x21A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMP" -->
            <field>
              <name>CMP</name>
              <description>Compare clear setting bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PCRC" -->
    <peripheral>
      <name>PCRC</name>
      <description>0</description>
      <version>A</version>
      <groupName>PCRC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PRGCRC_I2S" -->
      <interrupt>
        <name>PRGCRC_I2S</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PRGCRC_POLY" -->
        <register>
          <name>PRGCRC_POLY</name>
          <description>CRC Computing Generator Polynomial Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04C11DB7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_SEED" -->
        <register>
          <name>PRGCRC_SEED</name>
          <description>CRC Computing Initial Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_FXOR" -->
        <register>
          <name>PRGCRC_FXOR</name>
          <description>CRC Computing Resault XOR Value Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_CFG" -->
        <register>
          <name>PRGCRC_CFG</name>
          <description>CRC Computing Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00E00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LOCK" -->
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CDEN" -->
            <field>
              <name>CDEN</name>
              <description>DMA request enable</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIEN" -->
            <field>
              <name>CIEN</name>
              <description>Interrupt request enable</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQ" -->
            <field>
              <name>CIRQ</name>
              <description>Interrupt request</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SZ" -->
            <field>
              <name>SZ</name>
              <description>Input data size</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FI" -->
            <field>
              <name>FI</name>
              <description>Input data format</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FO" -->
            <field>
              <name>FO</name>
              <description>output data format</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQCLR" -->
            <field>
              <name>CIRQCLR</name>
              <description>Interrupt request clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRGCRC_WR" -->
        <register>
          <name>PRGCRC_WR</name>
          <description>CRC Computing Input Data Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
