lkolbly/cmsis-svd/data/Cypress/S6E2DH.svd
        <!-- REGISTER "ConfigClockControl" -->
        <register>
          <name>ConfigClockControl</name>
          <description>CONFIG Clock control register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ConfigClockSelect" -->
            <field>
              <name>ConfigClockSelect</name>
              <description>CONFIG Clock division ratio setting bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRamInterruptEnable" -->
        <register>
          <name>VRamInterruptEnable</name>
          <description>VRAM ECC error interrupt enable/disable register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VramInterruptEnableSec1" -->
            <field>
              <name>VramInterruptEnableSec1</name>
              <description>Interrupt control of VRAM ECC error for VRAM port1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VramInterruptEnableSec0" -->
            <field>
              <name>VramInterruptEnableSec0</name>
              <description>Interrupt control of VRAM ECC error for VRAM port0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRamInterruptClear" -->
        <register>
          <name>VRamInterruptClear</name>
          <description>VRAM ECC error interrupt clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VramInterruptClearSec1" -->
            <field>
              <name>VramInterruptClearSec1</name>
              <description>Clear interrupt of VRAM ECC error for VRAM port1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "VramInterruptClearSec0" -->
            <field>
              <name>VramInterruptClearSec0</name>
              <description>Clear interrupt of VRAM ECC error for VRAM port0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRamInterruptStatus" -->
        <register>
          <name>VRamInterruptStatus</name>
          <description>VRAM ECC error interrupt status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VramInterruptStatusSec1" -->
            <field>
              <name>VramInterruptStatusSec1</name>
              <description>Indicator of VRAM Interrupt status for VRAM port1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "VramInterruptStatusSec0" -->
            <field>
              <name>VramInterruptStatusSec0</name>
              <description>Indicator of VRAM Interrupt status for VRAM port0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ExtFlashDevSelect" -->
        <register>
          <name>ExtFlashDevSelect</name>
          <description>External Flash Device Selection register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ExtFlashDevSelect" -->
            <field>
              <name>ExtFlashDevSelect</name>
              <description>External memory device selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRamRemapDisable" -->
        <register>
          <name>VRamRemapDisable</name>
          <description>VRAM Remap Mode Disable register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VramRemapDisable" -->
            <field>
              <name>VramRemapDisable</name>
              <description>VRAM address remap or non-remap selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PanicSwitch" -->
        <register>
          <name>PanicSwitch</name>
          <description>Panic display mode switch register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PanicSwitch" -->
            <field>
              <name>PanicSwitch</name>
              <description>Panic display mode or Normal display mode selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
